In [1]:
# set sql connection
import pyodbc
server = 'RIC1D2RSGSQL01' 
database = 'EquityResearch' 
conn = pyodbc.connect('DRIVER={ODBC Driver 17 for SQL Server};SERVER='+server+';DATABASE='+database+';Trusted_Connection=yes;')

In [5]:
import pandas as pd

In [16]:
# define your parameters for SQL query
# Note to use strip [] from a list variable, which will give back comma delimitered & single quoted, exactly what SQL needed
# Dates in a str (feel free to change the query for dates selection, it can be daily between a & b, or in a list of dates)
# Security in a str


Dates = ['2019-01-31','2019-02-28','2019-03-29']
Security = ['AMZN','AAPL'] 

DateList = str(Dates).strip('[]') 
SecList = str(Security).strip('[]')

query = f'''SELECT SecurityId, TReturn, Date, Flag
--select count(1)
FROM EquityResearch.dbo.ReturnsHistory rh
	INNER JOIN securitydb.dbo.SecurityMaster_Hist sm
		ON rh.IntegerId = sm.IntegerId
		AND rh.Date BETWEEN sm.StartDate AND sm.EndDate
		-- AND LEFT(rh.IntegerId,1) = '1' --for US names
AND rh.Date IN ({DateList})
AND sm.Ticker IN ({SecList})
ORDER BY rh.Date
'''

query

"SELECT SecurityId, TReturn, Date, Flag\n--select count(1)\nFROM EquityResearch.dbo.ReturnsHistory rh\n\tINNER JOIN securitydb.dbo.SecurityMaster_Hist sm\n\t\tON rh.IntegerId = sm.IntegerId\n\t\tAND rh.Date BETWEEN sm.StartDate AND sm.EndDate\n\t\t-- AND LEFT(rh.IntegerId,1) = '1' --for US names\nAND rh.Date IN ('2019-01-31', '2019-02-28', '2019-03-29')\nAND sm.Ticker IN ('AMZN', 'AAPL')\nORDER BY rh.Date\n"

In [17]:
# running the query to get the data into a variable in Python
ret = pd.read_sql_query(query,conn)
ret

  SecurityId       TReturn       Date  Flag
0       AMZN  87764.937500 2019-01-31     0
1       AAPL  40222.238281 2019-01-31     0
2       AAPL  42023.039062 2019-02-28     0
3       AMZN  83736.000000 2019-02-28     0
4       AMZN  90931.906250 2019-03-29     0
5       AAPL  46100.359375 2019-03-29     0

In [25]:
# reorder df by Date (REQUIRED for using pct_change function)
ret.sort_values(by = ['SecurityId', 'Date'], inplace=True)

In [27]:
# calculate forward one month return
ret['MthRet'] = ret.groupby(['SecurityId']).TReturn.pct_change().shift(periods=-1)*100

In [28]:
ret

  SecurityId       TReturn       Date  Flag    MthRet
1       AAPL  40222.238281 2019-01-31     0  4.477127
2       AAPL  42023.039062 2019-02-28     0  9.702583
5       AAPL  46100.359375 2019-03-29     0       NaN
0       AMZN  87764.937500 2019-01-31     0 -4.590600
3       AMZN  83736.000000 2019-02-28     0  8.593563
4       AMZN  90931.906250 2019-03-29     0       NaN